# brew bundle dump

# Homebrew Taps
tap "heroku/brew"
tap "thezoraiz/ascii-image-converter"
tap "thoughtbot/formulae"

# Homebrew Formulae
brew "git"
brew "antigen"
brew "asdf"
brew "bat"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "figlet"
brew "fzf"
brew "gdu"
brew "gnu-tar"
brew "gzip"
brew "lazygit"
brew "libyaml"
brew "lolcat"
brew "neovim"
brew "mas"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "scmpuff"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "xclip"
brew "yarn"
brew "zoxide"
brew "zsh"

# Homebrew Casks
# cask "bartender-5" use the crack vers.
cask "betterdisplay"
cask "command-x"
cask "discord"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "insomnia"
cask "kitty"
cask "linearmouse"
cask "obs"
cask "postman"
cask "qbittorrent"
cask "raycast"
cask "spotify"
cask "stats"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "webstorm"

# Mac App Store apps
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
# mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025

# MacOS settings

# Finder
system "defaults write NSGlobalDomain AppleShowAllExtensions -bool true"
system "defaults write com.apple.finder AppleShowAllFiles -bool true"
system "defaults write com.apple.finder FXEnableExtensionChangeWarning -bool false"
system "defaults write com.apple.desktopservices DSDontWriteNetworkStores -bool true"
system "defaults write com.apple.desktopservices DSDontWriteUSBStores -bool true"

# Dock
system "defaults write com.apple.dock largesize -int 45"
system "defaults write com.apple.dock magnification -bool true"
system "defaults write com.apple.dock minimize-to-application -bool true"
system "defaults write com.apple.dock show-recents -bool false"
system "defaults write com.apple.dock tilesize -int 20"
system "defaults write com.apple.dock wvous-br-corner -int 4"
system "defaults write com.apple.dock wvous-br-modifier -int 0"
system "defaults write com.apple.dock autohide -bool true"
system "defaults write com.apple.dock autohide-time-modifier -int 0; killall Dock"
system "defaults write com.apple.dock autohide-delay -float 0; killall Dock"

# VSCode ext
vscode "aaron-bond.better-comments"
vscode "angular.ng-template"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "eenaree.webstorm-new-dark"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "k--kato.intellij-idea-keybindings"
vscode "leizongmin.node-module-intellisense"
vscode "miguelsolorio.fluent-icons"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ru"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-russian"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "zignd.html-css-class-completion"
