# brew bundle dump

# Homebrew Taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"

# Homebrew Formulae
brew "antigen"
brew "asdf"
brew "coreutils"
brew "curl"
brew "fd"
brew "figlet"
brew "fzf"
brew "gdu"
brew "git"
brew "gnu-tar"
brew "gzip"
brew "lazygit"
brew "libyaml"
brew "lolcat"
brew "neovim"
brew "mas"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "scmpuff"
brew "stow"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "xclip"
brew "yarn"
brew "zsh"

# Homebrew Casks
cask "amneziavpn"
cask "bittorrent"
cask "discord"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "kitty"
cask "postman"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "webstorm"

# Mac App Store apps
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025

# MacOS settings

# Finder
defaults write NSGlobalDomain AppleShowAllExtensions -bool true
defaults write com.apple.finder AppleShowAllFiles -bool true
defaults write com.apple.finder FXEnableExtensionChangeWarning -bool false
defaults write com.apple.desktopservices DSDontWriteNetworkStores -bool true
defaults write com.apple.desktopservices DSDontWriteUSBStores -bool true

# Dock
defaults write com.apple.dock largesize -int 45
defaults write com.apple.dock magnification -bool true
defaults write com.apple.dock minimize-to-application -bool true
defaults write com.apple.dock show-recents -bool false
defaults write com.apple.dock tilesize -int 30
defaults write com.apple.dock wvous-br-corner -int 4
defaults write com.apple.dock wvous-br-modifier -int 0
