# brew bundle dump

# Homebrew Taps
tap "anistark/tools"
tap "heroku/brew"
tap "thezoraiz/ascii-image-converter"
tap "thoughtbot/formulae"

# Homebrew Formulae
brew "git"
brew "antigen"
brew "asdf"
brew "bat"
brew "bottom"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-compose"
brew "espeak-ng"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gdu"
brew "gemini-cli"
brew "ghostscript"
brew "git-filter-repo"
brew "gnu-tar"
brew "gzip"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "leveldb"
brew "libyaml"
brew "lolcat"
brew "mas"
brew "mupdf-tools"
brew "neovim"
brew "nginx"
brew "ollama"
brew "pandoc"
brew "poppler"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "resvg"
brew "ripgrep"
brew "scmpuff"
brew "serie"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "xclip"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"

# Homebrew Casks
# cask "bartender-5" use the crack vers.
cask "appcleaner"
cask "betterdisplay"
cask "calibre"
cask "command-x"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "insomnia"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kitty"
cask "linearmouse"
cask "obs"
cask "postman"
cask "qbittorrent"
cask "spotify"
cask "stats"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "webstorm"
cask "zed"

# Mac App Store apps
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "WPS Office", id: 1468073139

# MacOS settings

# Finder
system "defaults write NSGlobalDomain AppleShowAllExtensions -bool true"
system "defaults write com.apple.finder AppleShowAllFiles -bool true"
system "defaults write com.apple.finder FXEnableExtensionChangeWarning -bool false"
system "defaults write com.apple.desktopservices DSDontWriteNetworkStores -bool true"
system "defaults write com.apple.desktopservices DSDontWriteUSBStores -bool true"

# Dock
system "defaults write com.apple.dock largesize -int 45"
system "defaults write com.apple.dock magnification -bool true"
system "defaults write com.apple.dock minimize-to-application -bool true"
system "defaults write com.apple.dock show-recents -bool false"
system "defaults write com.apple.dock tilesize -int 20"
system "defaults write com.apple.dock wvous-br-corner -int 4"
system "defaults write com.apple.dock wvous-br-modifier -int 0"
system "defaults write com.apple.dock autohide -bool true"
system "defaults write com.apple.dock autohide-time-modifier -int 0; killall Dock"
system "defaults write com.apple.dock autohide-delay -float 0; killall Dock"

# VSCode ext
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "angular.ng-template"
vscode "be5invis.vscode-custom-css"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eenaree.webstorm-new-dark"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "gruntfuggly.todo-tree"
vscode "k--kato.intellij-idea-keybindings"
vscode "leizongmin.node-module-intellisense"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ru"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ritwickdey.liveserver"
vscode "rokoroku.vscode-theme-darcula"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "zignd.html-css-class-completion"
